Deploy 951c39b7817a4e0dc49d02e6aaab5ea02c1ee0ed -> preview/claude-alert-manager-self-managed-proposal-596b57
